---
type: VectorAtPoint
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 2
tags: [revit-api, class]
---

# VectorAtPoint

`Autodesk.Revit.DB.Analysis.VectorAtPoint` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | VectorAtPoint | — | `` |
| Method | SetFlags | — | `` |